pandas中文网学习记录

网址:

https://www.pypandas.cn/docs/getting_started/10min.html#生成对象

In [1]:
import numpy as np
import pandas as pd

# 生成对象
Pandas 默认自动生成整数索引

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.331089  0.855946  1.707620  0.560236
2013-01-02  0.433754  0.325475 -0.268228  2.197462
2013-01-03 -0.524914 -0.142306 -0.762649 -0.033409
2013-01-04 -0.282323  0.590219  0.779604  0.317629
2013-01-05  0.111615  0.071296  0.775082 -0.860882
2013-01-06 -0.999092 -1.989074  0.581124  0.086520

In [5]:
# 用 Series 字典对象生成 DataFrame:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 查看数据

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.331089  0.855946  1.707620  0.560236
2013-01-02  0.433754  0.325475 -0.268228  2.197462
2013-01-03 -0.524914 -0.142306 -0.762649 -0.033409
2013-01-04 -0.282323  0.590219  0.779604  0.317629
2013-01-05  0.111615  0.071296  0.775082 -0.860882

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.282323  0.590219  0.779604  0.317629
2013-01-05  0.111615  0.071296  0.775082 -0.860882
2013-01-06 -0.999092 -1.989074  0.581124  0.086520

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.265341 -0.048074  0.468759  0.377926
std    0.498239  1.015364  0.871479  1.013542
min   -0.999092 -1.989074 -0.762649 -0.860882
25%   -0.476458 -0.088905 -0.055890 -0.003427
50%   -0.306706  0.198386  0.678103  0.202074
75%    0.013131  0.524033  0.778473  0.499584
max    0.433754  0.855946  1.707620  2.197462

In [12]:
df.T # 转置

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.331089    0.433754   -0.524914   -0.282323    0.111615   -0.999092
B    0.855946    0.325475   -0.142306    0.590219    0.071296   -1.989074
C    1.707620   -0.268228   -0.762649    0.779604    0.775082    0.581124
D    0.560236    2.197462   -0.033409    0.317629   -0.860882    0.086520

In [13]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.560236  1.707620  0.855946 -0.331089
2013-01-02  2.197462 -0.268228  0.325475  0.433754
2013-01-03 -0.033409 -0.762649 -0.142306 -0.524914
2013-01-04  0.317629  0.779604  0.590219 -0.282323
2013-01-05 -0.860882  0.775082  0.071296  0.111615
2013-01-06  0.086520  0.581124 -1.989074 -0.999092

In [14]:
df.sort_values(by='C') # 对排序

                   A         B         C         D
2013-01-03 -0.524914 -0.142306 -0.762649 -0.033409
2013-01-02  0.433754  0.325475 -0.268228  2.197462
2013-01-06 -0.999092 -1.989074  0.581124  0.086520
2013-01-05  0.111615  0.071296  0.775082 -0.860882
2013-01-04 -0.282323  0.590219  0.779604  0.317629
2013-01-01 -0.331089  0.855946  1.707620  0.560236

In [15]:
df['A']

2013-01-01   -0.331089
2013-01-02    0.433754
2013-01-03   -0.524914
2013-01-04   -0.282323
2013-01-05    0.111615
2013-01-06   -0.999092
Freq: D, Name: A, dtype: float64

用 [ ] 切片行：

In [16]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.331089  0.855946  1.707620  0.560236
2013-01-02  0.433754  0.325475 -0.268228  2.197462
2013-01-03 -0.524914 -0.142306 -0.762649 -0.033409

In [17]:
df['2013-01-01':'2013-01-03']

                   A         B         C         D
2013-01-01 -0.331089  0.855946  1.707620  0.560236
2013-01-02  0.433754  0.325475 -0.268228  2.197462
2013-01-03 -0.524914 -0.142306 -0.762649 -0.033409

In [18]:
df.loc[dates[0]]

A   -0.331089
B    0.855946
C    1.707620
D    0.560236
Name: 2013-01-01 00:00:00, dtype: float64

In [19]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.331089  0.855946
2013-01-02  0.433754  0.325475
2013-01-03 -0.524914 -0.142306
2013-01-04 -0.282323  0.590219
2013-01-05  0.111615  0.071296
2013-01-06 -0.999092 -1.989074

In [20]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.433754  0.325475
2013-01-03 -0.524914 -0.142306
2013-01-04 -0.282323  0.590219

In [21]:
df.loc[:,'A']

2013-01-01   -0.331089
2013-01-02    0.433754
2013-01-03   -0.524914
2013-01-04   -0.282323
2013-01-05    0.111615
2013-01-06   -0.999092
Freq: D, Name: A, dtype: float64

# 按位置选择

In [22]:
df.iloc[3]

A   -0.282323
B    0.590219
C    0.779604
D    0.317629
Name: 2013-01-04 00:00:00, dtype: float64

In [23]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.282323  0.590219
2013-01-05  0.111615  0.071296

In [24]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.433754 -0.268228
2013-01-03 -0.524914 -0.762649
2013-01-05  0.111615  0.775082

# 布尔索引

In [25]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.433754  0.325475 -0.268228  2.197462
2013-01-05  0.111615  0.071296  0.775082 -0.860882

In [26]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.855946  1.707620  0.560236
2013-01-02  0.433754  0.325475       NaN  2.197462
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04       NaN  0.590219  0.779604  0.317629
2013-01-05  0.111615  0.071296  0.775082       NaN
2013-01-06       NaN       NaN  0.581124  0.086520

In [27]:
df2 = df.copy()

In [28]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [29]:
df2

                   A         B         C         D      E
2013-01-01 -0.331089  0.855946  1.707620  0.560236    one
2013-01-02  0.433754  0.325475 -0.268228  2.197462    one
2013-01-03 -0.524914 -0.142306 -0.762649 -0.033409    two
2013-01-04 -0.282323  0.590219  0.779604  0.317629  three
2013-01-05  0.111615  0.071296  0.775082 -0.860882   four
2013-01-06 -0.999092 -1.989074  0.581124  0.086520  three

In [30]:
 df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.524914 -0.142306 -0.762649 -0.033409   two
2013-01-05  0.111615  0.071296  0.775082 -0.860882  four

# 赋值

In [31]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20191226', periods=6))
s1

2019-12-26    1
2019-12-27    2
2019-12-28    3
2019-12-29    4
2019-12-30    5
2019-12-31    6
Freq: D, dtype: int64

In [32]:
df.at[dates[0], 'A'] = 0

In [33]:
df.iat[0, 1] = 0

In [34]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [35]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  1.707620  5
2013-01-02  0.433754  0.325475 -0.268228  5
2013-01-03 -0.524914 -0.142306 -0.762649  5
2013-01-04 -0.282323  0.590219  0.779604  5
2013-01-05  0.111615  0.071296  0.775082  5
2013-01-06 -0.999092 -1.989074  0.581124  5

用 where 条件赋值：

In [36]:
df2 = df.copy()

In [37]:
df2[df2 > 0] = -df2

In [38]:
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -1.707620 -5
2013-01-02 -0.433754 -0.325475 -0.268228 -5
2013-01-03 -0.524914 -0.142306 -0.762649 -5
2013-01-04 -0.282323 -0.590219 -0.779604 -5
2013-01-05 -0.111615 -0.071296 -0.775082 -5
2013-01-06 -0.999092 -1.989074 -0.581124 -5

# 缺失值

重建索引（reindex）可以更改、添加、删除指定轴的索引，并返回数据副本，即不更改原数据

In [39]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.707620  5  1.0
2013-01-02  0.433754  0.325475 -0.268228  5  1.0
2013-01-03 -0.524914 -0.142306 -0.762649  5  NaN
2013-01-04 -0.282323  0.590219  0.779604  5  NaN

删除所有含缺失值的行：

In [40]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.707620  5  1.0
2013-01-02  0.433754  0.325475 -0.268228  5  1.0

填充缺失值：

In [42]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.707620  5  1.0
2013-01-02  0.433754  0.325475 -0.268228  5  1.0
2013-01-03 -0.524914 -0.142306 -0.762649  5  5.0
2013-01-04 -0.282323  0.590219  0.779604  5  5.0

提取 nan 值的布尔掩码：

In [43]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

# 运算

## 统计

一般情况下，运算时排除缺失值。

In [44]:
df.mean()

A   -0.210160
B   -0.190732
C    0.468759
D    5.000000
dtype: float64

In [45]:
df.mean(1) # 在另一个轴(即，行)上执行同样的操作：

2013-01-01    1.676905
2013-01-02    1.372750
2013-01-03    0.892533
2013-01-04    1.521875
2013-01-05    1.489498
2013-01-06    0.648240
Freq: D, dtype: float64

不同维度对象运算时，要先对齐。 此外，Pandas 自动沿指定维度广播。

## 直方图

In [46]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    1
1    0
2    1
3    1
4    2
5    3
6    0
7    4
8    5
9    4
dtype: int32

In [47]:
s.value_counts()

1    3
4    2
0    2
5    1
3    1
2    1
dtype: int64

# 合并（Merge）

## 结合（Concat）

Pandas 提供了多种将 Series、DataFrame 对象组合在一起的功能，用索引与关联代数功能的多种设置逻辑可执行连接（join）与合并（merge）操作。

In [48]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.221206 -1.746357  1.987347 -0.750111
1  0.947819 -0.346353  1.556937  0.964691
2  1.093562  1.201680 -0.206146  0.973372
3  1.028638  0.783578 -0.469907  0.436066
4 -2.204787 -0.201284 -1.225507  0.701889
5 -1.526977 -1.671137  1.084828 -0.464350
6  0.385325 -0.332181  0.773636  1.279945
7  0.687011 -0.451129  0.550453  0.627339
8  0.095084  0.565106 -0.957405  1.857176
9  0.661727  0.363314  0.642313 -0.203787

In [50]:
pieces = [df[:3], df[3:7], df[7:]] # 分解为多组
pieces

[          0         1         2         3
 0 -0.221206 -1.746357  1.987347 -0.750111
 1  0.947819 -0.346353  1.556937  0.964691
 2  1.093562  1.201680 -0.206146  0.973372,
           0         1         2         3
 3  1.028638  0.783578 -0.469907  0.436066
 4 -2.204787 -0.201284 -1.225507  0.701889
 5 -1.526977 -1.671137  1.084828 -0.464350
 6  0.385325 -0.332181  0.773636  1.279945,
           0         1         2         3
 7  0.687011 -0.451129  0.550453  0.627339
 8  0.095084  0.565106 -0.957405  1.857176
 9  0.661727  0.363314  0.642313 -0.203787]

In [51]:
pd.concat(pieces)

          0         1         2         3
0 -0.221206 -1.746357  1.987347 -0.750111
1  0.947819 -0.346353  1.556937  0.964691
2  1.093562  1.201680 -0.206146  0.973372
3  1.028638  0.783578 -0.469907  0.436066
4 -2.204787 -0.201284 -1.225507  0.701889
5 -1.526977 -1.671137  1.084828 -0.464350
6  0.385325 -0.332181  0.773636  1.279945
7  0.687011 -0.451129  0.550453  0.627339
8  0.095084  0.565106 -0.957405  1.857176
9  0.661727  0.363314  0.642313 -0.203787

## 连接（join）

In [52]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [53]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [54]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [55]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

## 追加（Append）

In [56]:
df = pd.DataFrame(np.random.randn(8, 4), 
                  columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  1.971445 -0.713758 -1.704532  0.040535
1 -0.320080 -2.232481 -0.854516 -0.542489
2 -0.696968  1.561525 -0.718820  0.091116
3  0.115640 -1.233411  0.192959 -0.450220
4 -0.020243  0.737642  0.092457  0.286096
5  1.092426 -0.994028 -0.672386 -0.453493
6  0.499615  0.199999  0.844064 -0.708710
7  1.189615  0.912193  1.337531 -0.207583

In [58]:
s = df.iloc[3]
s

A    0.115640
B   -1.233411
C    0.192959
D   -0.450220
Name: 3, dtype: float64

In [59]:
df.append(s, ignore_index=True)

          A         B         C         D
0  1.971445 -0.713758 -1.704532  0.040535
1 -0.320080 -2.232481 -0.854516 -0.542489
2 -0.696968  1.561525 -0.718820  0.091116
3  0.115640 -1.233411  0.192959 -0.450220
4 -0.020243  0.737642  0.092457  0.286096
5  1.092426 -0.994028 -0.672386 -0.453493
6  0.499615  0.199999  0.844064 -0.708710
7  1.189615  0.912193  1.337531 -0.207583
8  0.115640 -1.233411  0.192959 -0.450220

## 更多

`pandas.pivot_table()`

# 分组（Grouping）

In [62]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  2.541709 -0.520201
1  bar    one  0.408220  1.607306
2  foo    two -1.620497  0.057046
3  bar  three -0.633470  1.302304
4  foo    two -0.167303  1.757369
5  bar    two  1.341080 -0.406329
6  foo    one  0.352737  1.935990
7  foo  three  0.615936 -0.367079

In [66]:
df.groupby('A').sum()

            C         D
A
bar  1.115829  2.503281
foo  1.722582  2.863124

In [67]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.408220  1.607306
    three -0.633470  1.302304
    two    1.341080 -0.406329
foo one    2.894446  1.415788
    three  0.615936 -0.367079
    two   -1.787800  1.814414

# 重塑

## 堆叠 Stack

`df.stack()`

`df.unstack()`

# 数据透视表（Pivot Tables）

In [74]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
   .....:          'B': ['A', 'B', 'C'] * 4,
   .....:          'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                 'D': np.random.randn(12),
   .....:                    'E': np.random.randn(12)})

In [75]:
df

        A  B    C         D         E
0     one  A  foo  0.321624  0.314892
1     one  B  foo  0.292860 -0.452334
2     two  C  foo -0.468070  0.524742
3   three  A  bar -0.705324  0.498907
4     one  B  bar  1.601517  0.030599
5     one  C  bar -0.263114 -0.537433
6     two  A  foo -0.525668 -1.120580
7   three  B  foo  1.221337  1.309723
8     one  C  foo  0.079430  1.489084
9     one  A  bar -0.529933 -0.479159
10    two  B  bar -0.019549  0.697445
11  three  C  bar -0.913616 -0.401910

In [73]:
pd.pivot_table(df, values=['D','E'], index=['A', 'B'],
               columns=['C'])

                D                   E
C             bar       foo       bar       foo
A     B
one   A  0.934676 -1.694920  2.643694  2.026893
      B -0.782842 -0.810141 -0.104577  1.086113
      C -0.260221 -1.118910  0.318582  0.498619
three A -0.570719       NaN  0.193307       NaN
      B       NaN  0.604172       NaN -2.024425
      C  0.733105       NaN  1.004881       NaN
two   A       NaN  1.368494       NaN -0.436337
      B -0.423162       NaN -0.104093       NaN
      C       NaN -0.176296       NaN  0.724185